<script setup>
const accordionItems = [
  {
    title: "چه نوع طلا و جواهراتی در گالری طلا عبدولی به فروش می رسد؟",
    content:
      "گالری طلا عبدولی طیف گسترده ای از طلا و جواهرات را از جمله گردنبند، دستبند، گوشواره، انگشتر، سنجاق سینه و غیره ارائه می دهد. ما همچنین مجموعه ای از جواهرات الماس، زمرد، یاقوت و سایر سنگ های قیمتی را به فروش می رسانیم.",
  },
  {
    title: "آیا می توانم جواهرات سفارشی سفارش دهم؟",
    content:
      "گالری طلا عبدولی طیف گسترده ای از طلا و جواهرات را از جمله گردنبند، دستبند، گوشواره، انگشتر، سنجاق سینه و غیره ارائه می دهد. ما همچنین مجموعه ای از جواهرات الماس، زمرد، یاقوت و سایر سنگ های قیمتی را به فروش می رسانیم.",
  },
  {
    title: "چه روش های پرداختی را می پذیرید؟",
    content:
      "گالری طلا عبدولی طیف گسترده ای از طلا و جواهرات را از جمله گردنبند، دستبند، گوشواره، انگشتر، سنجاق سینه و غیره ارائه می دهد. ما همچنین مجموعه ای از جواهرات الماس، زمرد، یاقوت و سایر سنگ های قیمتی را به فروش می رسانیم.",
  },
  {
    title: "آیا خرید آنلاین امن است؟",
    content:
      "گالری طلا عبدولی طیف گسترده ای از طلا و جواهرات را از جمله گردنبند، دستبند، گوشواره، انگشتر، سنجاق سینه و غیره ارائه می دهد. ما همچنین مجموعه ای از جواهرات الماس، زمرد، یاقوت و سایر سنگ های قیمتی را به فروش می رسانیم.",
  },

  {
    title: "سفارشات من چگونه ارسال می شوند؟",
    content:
      "گالری طلا عبدولی طیف گسترده ای از طلا و جواهرات را از جمله گردنبند، دستبند، گوشواره، انگشتر، سنجاق سینه و غیره ارائه می دهد. ما همچنین مجموعه ای از جواهرات الماس، زمرد، یاقوت و سایر سنگ های قیمتی را به فروش می رسانیم.",
  },

  {
    title: "چه مدت طول می کشد تا سفارش من تحویل داده شود؟",
    content:
      "گالری طلا عبدولی طیف گسترده ای از طلا و جواهرات را از جمله گردنبند، دستبند، گوشواره، انگشتر، سنجاق سینه و غیره ارائه می دهد. ما همچنین مجموعه ای از جواهرات الماس، زمرد، یاقوت و سایر سنگ های قیمتی را به فروش می رسانیم.",
  },
];

const activeIndex = ref(null);

const toggle = (index) => {
  activeIndex.value = activeIndex.value === index ? null : index;
};
</script>

<template>
  <div class="dashboard-accordion">
    <div class="accordion">
      <div
        v-for="(item, index) in accordionItems"
        :key="index"
        class="accordion-item"
      >
        <div class="accordion-header" @click="toggle(index)">
          <span>{{ item.title }}</span>
        </div>
        <transition name="fade">
          <div v-if="activeIndex === index" class="accordion-body">
            <p>
              {{ item.content }}
            </p>
          </div>
        </transition>
      </div>
    </div>
  </div>
</template>

<style lang="scss" scoped>
.fade-enter-active,
.fade-leave-active {
  transition: opacity 0.3s ease;
}

.fade-enter-from,
.fade-leave-to {
  opacity: 0;
}
</style>
