<script setup>
const route = useRoute();
const breadcrumb = [
  {
    title: "خانه",
    disabled: false,
    to: "/",
  },
  {
    title: "وبلاگ",
    disabled: false,
    to: "/blog",
  },
  {
    title: route.params.blog_id,
    disabled: true,
  },
];
</script>
<template>
  <div class="blog-details px-4 px-lg-16 py-2">
    <WidgetsBreadcrumb :items="breadcrumb" />
    <div class="blog-details-wrapper">
      <div class="blog-details-wrapper_img">
        <img src="@/assets/images/blog-1.png" alt="jwelery-abdevali" />
      </div>
      <h1 class="blog-details-wrapper_title">
        ظرافت بی‌زمان: بررسی ترند‌های جواهرات قدیمی
      </h1>
      <div class="blog-details-wrapper_titles-box">
        <ul>
          <li>
            <a href="#title1"> ۱.سرتیتر اول </a>
          </li>
          <li>
            <a href="title2"> ۲.سرتیتر دوم </a>
          </li>
          <li>
            <a href="title3"> ۳.سرتیتر سوم </a>
          </li>
          <li>
            <a href="title4"> ۴.سرتیتر چهارم </a>
          </li>
          <li>
            <a href="title5"> ۵.سرتیتر پنجم </a>
          </li>
        </ul>
      </div>
      <div class="blog-details-wrapper_content">
        <h2 class="blog-details-wrapper_content-title" id="title1">
          سرتیتر اول
        </h2>
        <p>
          لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
          استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در
          ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و
          کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی
          در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می
          طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
          الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این
          صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و
          شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای
          اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده
          قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و
          با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در
          ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و
          کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی
          در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می
          طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
          الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این
          صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و
          شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای
          اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده
          قرار گیرد.
        </p>
        <div class="blog-details-wrapper_content-img">
          <img src="@/assets/images/blog-1.png" alt="jwelery-abdevali" />
        </div>
      </div>
    </div>
  </div>
</template>

<style lang="scss" scoped></style>
