<script setup>
const route = useRoute();
const breadcrumb = [
  {
    title: "خانه",
    disabled: false,
    to: "/",
  },
  {
    title: "وبلاگ",
    disabled: true,
    to: "/blog",
  },
];
const blogs = [
    {img:"./assets/images/blog-1.png", title:"ظرافت بی‌زمان: بررسی ترند‌های جواهرات قدیمی", text:"  به دنیایی قدم بگذارید که در آن وینتیج با مدرن روبرو می‌شود—مجموعه‌ای از جواهرات الهام‌گرفته از کلاسیک ما فراتر از  زمان است. کارهای پیچیده فیلیگرن، سنگ های قیمتی ارثی، و داستان  های پشت هر قطعه را کشف کنید. چه به جذابیت هنر دکو یا عاشقانه های ویکتوریایی کشیده شده باشید، جواهرات ما جذابیت پایدار گذشته را جشن می گیرند."},
        {img:"./assets/images/blog-2.png", title:"ظرافت بی‌زمان: بررسی ترند‌های جواهرات قدیمی", text:"  به دنیایی قدم بگذارید که در آن وینتیج با مدرن روبرو می‌شود—مجموعه‌ای از جواهرات الهام‌گرفته از کلاسیک ما فراتر از  زمان است. کارهای پیچیده فیلیگرن، سنگ های قیمتی ارثی، و داستان  های پشت هر قطعه را کشف کنید. چه به جذابیت هنر دکو یا عاشقانه های ویکتوریایی کشیده شده باشید، جواهرات ما جذابیت پایدار گذشته را جشن می گیرند."},
    {img:"./assets/images/blog-3.png", title:"ظرافت بی‌زمان: بررسی ترند‌های جواهرات قدیمی", text:"  به دنیایی قدم بگذارید که در آن وینتیج با مدرن روبرو می‌شود—مجموعه‌ای از جواهرات الهام‌گرفته از کلاسیک ما فراتر از  زمان است. کارهای پیچیده فیلیگرن، سنگ های قیمتی ارثی، و داستان  های پشت هر قطعه را کشف کنید. چه به جذابیت هنر دکو یا عاشقانه های ویکتوریایی کشیده شده باشید، جواهرات ما جذابیت پایدار گذشته را جشن می گیرند."},
    {img:"./assets/images/blog-4.png", title:"ظرافت بی‌زمان: بررسی ترند‌های جواهرات قدیمی", text:"  به دنیایی قدم بگذارید که در آن وینتیج با مدرن روبرو می‌شود—مجموعه‌ای از جواهرات الهام‌گرفته از کلاسیک ما فراتر از  زمان است. کارهای پیچیده فیلیگرن، سنگ های قیمتی ارثی، و داستان  های پشت هر قطعه را کشف کنید. چه به جذابیت هنر دکو یا عاشقانه های ویکتوریایی کشیده شده باشید، جواهرات ما جذابیت پایدار گذشته را جشن می گیرند."},
    {img:"./assets/images/blog-5.png", title:"ظرافت بی‌زمان: بررسی ترند‌های جواهرات قدیمی", text:"  به دنیایی قدم بگذارید که در آن وینتیج با مدرن روبرو می‌شود—مجموعه‌ای از جواهرات الهام‌گرفته از کلاسیک ما فراتر از  زمان است. کارهای پیچیده فیلیگرن، سنگ های قیمتی ارثی، و داستان  های پشت هر قطعه را کشف کنید. چه به جذابیت هنر دکو یا عاشقانه های ویکتوریایی کشیده شده باشید، جواهرات ما جذابیت پایدار گذشته را جشن می گیرند."},

]
</script>
<template>
  <div class="blog px-4 px-lg-16 py-2">
    <WidgetsBreadcrumb :items="breadcrumb" />
    <div class="blog-wrapper">
      <div class="blog-wrapper_card mb-6" v-for="(item, i) in blogs" :key="i">
        <v-row class="align-center">
          <v-col cols="12" md="6">
            <div class="blog-wrapper_card-img">
              <img :src="item.img" alt="" />
            </div>
          </v-col>
          <v-col cols="12" md="6">
            <div>
              <div class="blog-wrapper_card-title">
                {{ item.title }}
              </div>
              <p class="blog-wrapper_card-text">
                {{ item.text }}
              </p>
              <div class="d-flex justify-end w-100 blog-wrapper_card-btn">
                <v-btn color="primary" flat> ادامه مطلب </v-btn>
              </div>
            </div>
          </v-col>
        </v-row>
      </div>
    </div>
  </div>
</template>



<style lang="scss" scoped></style>
