<template>
  <div class="gift px-4 px-lg-16 py-2">
    <WidgetsBreadcrumb :items="breadcrumb" />
    <div class="gift-wrapper">
      <h1 class="category_title mb-6">هدیه‌ای خاص از گالری طلا عبدولی</h1>
      <div class="gift-wrapper_image">
        <img src="@/assets/images/gift.png" alt="" />
      </div>
      <div class="gift-wrapper_text">
        <p class="mb-5">
          در گالری طلا عبدولی، ما به شما این امکان را می‌دهیم که با انتخاب یک
          هدیه خاص و زیبا از مجموعه‌های متنوع ما، عشق و توجه خود را به عزیزانتان
          نشان دهید. اکنون شما می‌توانید به راحتی و با چند کلیک ساده، هدیه‌ای
          منحصر به فرد را از سایت ما انتخاب کرده و آن را برای فرد مورد نظرتان
          ارسال کنید.
        </p>
        <p class="mb-5">ویژگی‌های ارسال هدیه در گالری طلا عبدولی</p>
        <ul>
          <li>
             - تنوع گسترده محصولات: از انواع گردنبندها، دستبندها، انگشترها و
            سایر زیورآلات با طراحی‌های مدرن و کلاسیک.
          </li>
          <li>
             - بسته‌بندی شیک و زیبا: تمامی هدایا با بسته‌بندی‌های لوکس و جذاب
            ارسال می‌شوند که به جذابیت هدیه شما می‌افزایند.
          </li>
          <li>
             - ارسال سریع و امن: ما تضمین می‌کنیم که هدیه شما به موقع و با نهایت
            دقت به دست گیرنده برسد.
          </li>
          <li>
            - پیام اختصاصی: شما می‌توانید یک پیام شخصی و اختصاصی برای عزیزتان
            اضافه کنید تا هدیه‌تان را خاص‌تر کنید.
          </li>
        </ul>
        <p>
          با ما همراه باشید و تجربه‌ای متفاوت از هدیه دادن را با گالری طلا
          عبدولی احساس کنید.
        </p>
      </div>
    </div>
  </div>
</template>

<script setup>
const route = useRoute();
const breadcrumb = [
  {
    title: "خانه",
    disabled: false,
    to: "/",
  },
  {
    title: "هدیه",
    disabled: true,
    to: "/gift",
  },
];
</script>

<style lang="scss" scoped></style>
